// Описати своїми словами у кілька рядків, навіщо у програмуванні потрібні цикли.
//цилки у програмуванні потрібні задля того, щоб мати можливість робити повторювані кроки без додаткового їх пропису
// Опишіть у яких ситуаціях ви використовували той чи інший цикл в JS.
// я використовувала цикл задля того, щоб програма запитувала користувача до тих пір, поки він/вона не введе число, а не літеру чи щось інше
// Що таке явне та неявне приведення (перетворення) типів даних у JS?
// приведення типів це, коли розробник хоче конвертувати значення одного типу на значення іншого типу, записуючи це відповідним чином у коді (наприклад з явного Number(value))
//також == може зробити неявне приведення типів

// Завдання
// Реалізувати програму на Javascript, яка знаходитиме всі числа кратні 5 (діляться на 5 без залишку) у заданому діапазоні. 
// Завдання має бути виконане на чистому Javascript без використання бібліотек типу jQuery або React.

// Технічні вимоги:
// Отримати за допомогою модального вікна браузера число, яке введе користувач.
// Вивести в консолі всі числа, кратні 5, від 0 до введеного користувачем числа. 
// Якщо таких чисел немає - вивести в консоль фразу "Sorry, no numbers" 
// Обов'язково необхідно використовувати синтаксис ES6 (ES2015) для створення змінних.

let number = null

do{
    number = +prompt("your number?")
}while(!Number.isInteger(number))

if (number < 5){
    console.log("Sorry, no numbers")
} 

for (let i=0; i<=number; i++){ 
 if (i % 5 === 0){  
     console.log(i) 
 }
}